РезервированиеТоваров/Documents/РеализацияТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>РеализацияТоваровУслуг</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РЗ_ЗарезервированныеТовары</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СчетНаОплатуПокупателю</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

РезервированиеТоваров/AccumulationRegisters/РЗ_ЗарезервированныеТовары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РЗ_ЗарезервированныеТовары</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетПокупателю</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

РезервированиеТоваров/Documents/РеализацияТоваровУслуг/Ext/ObjectModule.bsl
&После("ОбработкаПроведения")
Процедура РЗ_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Отказ Тогда
		Возврат
	КонецЕсли;
	
	Движения.РЗ_ЗарезервированныеТовары.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	|	РЗ_ЗарезервированныеТоварыОстатки.Номенклатура КАК Номенклатура,
	|	РЗ_ЗарезервированныеТоварыОстатки.СчетПокупателю КАК СчетПокупателю,
	|	ВЫБОР
	|		КОГДА РЗ_ЗарезервированныеТоварыОстатки.КоличествоОстаток < РеализацияТоваровУслугТовары.Количество
	|			ТОГДА РЗ_ЗарезервированныеТоварыОстатки.КоличествоОстаток
	|		ИНАЧЕ РеализацияТоваровУслугТовары.Количество
	|	КОНЕЦ КАК Количество
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РЗ_ЗарезервированныеТовары.Остатки КАК РЗ_ЗарезервированныеТоварыОстатки
	|		ПО РеализацияТоваровУслугТовары.Номенклатура = РЗ_ЗарезервированныеТоварыОстатки.Номенклатура
	|			И РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю = РЗ_ЗарезервированныеТоварыОстатки.СчетПокупателю
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|	И РЗ_ЗарезервированныеТоварыОстатки.КоличествоОстаток > 0";
	
	ТаблицаСписанияСРезервирования = Запрос.Выполнить().Выгрузить();
	
	Для каждого ТекСтрока Из ТаблицаСписанияСРезервирования Цикл
		Движение = Движения.РЗ_ЗарезервированныеТовары.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Количество = ТекСтрока.Количество;
		Движение.Номенклатура = ТекСтрока.Номенклатура;
		Движение.СчетПокупателю = ТекСтрока.СчетПокупателю;
	КонецЦикла;
	
КонецПроцедуры
